<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Языковые ресурсы для модуля customer (редактирование чат ботов)
    |--------------------------------------------------------------------------
    |
    | Последующие языковые строки содержат сообщения по-умолчанию, используемые
    | классом, проверяющим значения (валидатором). Некоторые из правил имеют
    | несколько версий, например, size. Вы можете поменять их на любые
    | другие, которые лучше подходят для вашего приложения.
    |
    */
    'edit' => 'Редактировать',
    'del' => 'Удалить',
    'message_default' => 'Вы просто напишите слова, а я буду говорить :D',
    'block_buttons' => 'Блок с кнопками',
    'block_answer' => 'Блок с ответом',
    'confirm_delete' => 'Вы действительно хотите удалить бота?',
    'to_begin' => 'В начало',
    'confirm' => 'Подтвердить',
    'cancel' => 'Отмена',
    'block_name' => 'Имя блока',
    'block_name_description' => 'Имя блока назначается, чтобы его запомнить',
    'messages' => 'Сообщения',
    'add_message' => 'Добавить сообщение',
    'block_type' => 'Тип блока',
    'add_button' => 'Добавить кнопку',
    'text_on_button' => 'Текст на кнопке',
    'add_bot' => 'Добавить бота',
    'add_block' => 'Добавить блок',
    'fill_fields' => 'Заполните поля',
    'block_edit' => 'Редактирование блока',
    'errors' => [
        'block_type' => 'Ошибка: не верный тип блока',
        'cancelled_operation' => 'Операция отменена',
        'bot_id_empty' => 'Значение botId не передано',
    ],
    'confirm_action' => 'Подтвердите действие',
];
